#### [`repos-partners`] Terraform Plan 📖`success`

<a href="https://app.terraform.io/app/cdktf-team/prebuilt-providers-partners/runs/run-fK9f7R7CcUMAHN9K" target="_blank">Remote Plan Link ↗️</a>

<details><summary>Show Plan</summary>

```tf
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/cdktf-team/prebuilt-providers-partners/runs/run-fK9f7R7CcUMAHN9K

Waiting for the plan to start...

Terraform v1.8.5
on linux_amd64
Initializing plugins and modules...
data.github_team.cdktf-team-cdktf: Reading...
github_repository.cdktf-provider-mongodbatlas_repo_F46B7D14: Refreshing state... [id=cdktf-provider-mongodbatlas]
github_repository.cdktf-provider-mongodbatlas-go_repo_73B8D506: Refreshing state... [id=cdktf-provider-mongodbatlas-go]
github_repository.cdktf-provider-launchdarkly_repo_57376D7D: Refreshing state... [id=cdktf-provider-launchdarkly]
github_repository.cdktf-provider-launchdarkly-go_repo_51C67FC4: Refreshing state... [id=cdktf-provider-launchdarkly-go]
github_issue_label.cdktf-provider-mongodbatlas-go_repository-setup_automerge-label_6A04EB24: Refreshing state... [id=cdktf-provider-mongodbatlas-go:automerge]
github_issue_label.cdktf-provider-mongodbatlas-go_repository-setup_auto-approve-label_B527F695: Refreshing state... [id=cdktf-provider-mongodbatlas-go:auto-approve]
github_repository_webhook.cdktf-provider-mongodbatlas-go_repository-setup_slack-webhook_A27AE275: Refreshing state... [id=398580580]
github_issue_label.cdktf-provider-mongodbatlas-go_repository-setup_no-auto-close-label_DB6B70B4: Refreshing state... [id=cdktf-provider-mongodbatlas-go:no-auto-close]
github_repository_webhook.cdktf-provider-mongodbatlas_repository-setup_slack-webhook_BB90F959: Refreshing state... [id=398580582]
github_actions_secret.cdktf-provider-mongodbatlas_repo_secret-twine-password_C2DE8DEF: Refreshing state... [id=cdktf-provider-mongodbatlas:TWINE_PASSWORD]
github_actions_secret.cdktf-provider-mongodbatlas_repo_secret-maven-gpg-private-key_CE85BAE4: Refreshing state... [id=cdktf-provider-mongodbatlas:MAVEN_GPG_PRIVATE_KEY]
github_actions_secret.cdktf-provider-mongodbatlas_repo_secret-nuget-api-key_404500D3: Refreshing state... [id=cdktf-provider-mongodbatlas:NUGET_API_KEY]
github_actions_secret.cdktf-provider-mongodbatlas_repo_secret-maven-password_95B7424C: Refreshing state... [id=cdktf-provider-mongodbatlas:MAVEN_PASSWORD]
github_actions_secret.cdktf-provider-mongodbatlas_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_1B9B597E: Refreshing state... [id=cdktf-provider-mongodbatlas:GO_GITHUB_TOKEN]
github_actions_secret.cdktf-provider-mongodbatlas_repo_secret-maven-staging-profile-id_7A0DF91E: Refreshing state... [id=cdktf-provider-mongodbatlas:MAVEN_STAGING_PROFILE_ID]
github_branch_protection.cdktf-provider-mongodbatlas_repository-setup_main-protection_C19EA731: Refreshing state... [id=BPR_kwDOI2liXc4CAYbG]
github_actions_secret.cdktf-provider-mongodbatlas_repo_secret-alert-prs-slack-webhook-url_A0CA0B2B: Refreshing state... [id=cdktf-provider-mongodbatlas:ALERT_PRS_SLACK_WEBHOOK_URL]
github_issue_label.cdktf-provider-mongodbatlas_repository-setup_automerge-label_ADD15693: Refreshing state... [id=cdktf-provider-mongodbatlas:automerge]
github_actions_secret.cdktf-provider-mongodbatlas_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_8FE34BA4: Refreshing state... [id=cdktf-provider-mongodbatlas:PROJEN_GITHUB_TOKEN]
github_actions_secret.cdktf-provider-mongodbatlas_repo_secret-twine-username_CFC0E61E: Refreshing state... [id=cdktf-provider-mongodbatlas:TWINE_USERNAME]
github_actions_secret.cdktf-provider-mongodbatlas_repo_secret-npm-token_1689F3C4: Refreshing state... [id=cdktf-provider-mongodbatlas:NPM_TOKEN]
github_actions_secret.cdktf-provider-mongodbatlas_repo_secret-maven-gpg-private-key-passphrase_64B68B77: Refreshing state... [id=cdktf-provider-mongodbatlas:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_issue_label.cdktf-provider-mongodbatlas_repository-setup_auto-approve-label_99A7C58D: Refreshing state... [id=cdktf-provider-mongodbatlas:auto-approve]
github_actions_secret.cdktf-provider-mongodbatlas_repo_secret-gh-token_6F32D8A9: Refreshing state... [id=cdktf-provider-mongodbatlas:GH_TOKEN]
github_actions_secret.cdktf-provider-mongodbatlas_repo_secret-maven-username_553FE0BE: Refreshing state... [id=cdktf-provider-mongodbatlas:MAVEN_USERNAME]
github_issue_label.cdktf-provider-mongodbatlas_repository-setup_no-auto-close-label_B69409C0: Refreshing state... [id=cdktf-provider-mongodbatlas:no-auto-close]
data.github_team.cdktf-team-cdktf: Read complete after 6s [id=6602018]
github_issue_label.cdktf-provider-launchdarkly-go_repository-setup_auto-approve-label_012BCC12: Refreshing state... [id=cdktf-provider-launchdarkly-go:auto-approve]
github_issue_label.cdktf-provider-launchdarkly-go_repository-setup_automerge-label_0BF643DC: Refreshing state... [id=cdktf-provider-launchdarkly-go:automerge]
github_repository_webhook.cdktf-provider-launchdarkly-go_repository-setup_slack-webhook_305584AF: Refreshing state... [id=425871230]
github_issue_label.cdktf-provider-launchdarkly-go_repository-setup_no-auto-close-label_D19F8828: Refreshing state... [id=cdktf-provider-launchdarkly-go:no-auto-close]
github_branch_protection.cdktf-provider-launchdarkly_repository-setup_main-protection_5F1810F7: Refreshing state... [id=BPR_kwDOJ_5BQc4CYBOl]
github_actions_secret.cdktf-provider-launchdarkly_repo_secret-twine-password_5E892A79: Refreshing state... [id=cdktf-provider-launchdarkly:TWINE_PASSWORD]
github_issue_label.cdktf-provider-launchdarkly_repository-setup_automerge-label_3D9A8B34: Refreshing state... [id=cdktf-provider-launchdarkly:automerge]
github_actions_secret.cdktf-provider-launchdarkly_repo_secret-maven-gpg-private-key-passphrase_F7104486: Refreshing state... [id=cdktf-provider-launchdarkly:MAVEN_GPG_PRIVATE_KEY_PASSPHRASE]
github_actions_secret.cdktf-provider-launchdarkly_repo_secret-gh-token_85560652: Refreshing state... [id=cdktf-provider-launchdarkly:GH_TOKEN]
github_actions_secret.cdktf-provider-launchdarkly_repo_secret-maven-password_503A29DE: Refreshing state... [id=cdktf-provider-launchdarkly:MAVEN_PASSWORD]
github_actions_secret.cdktf-provider-launchdarkly_repo_secret-nuget-api-key_2B54AA56: Refreshing state... [id=cdktf-provider-launchdarkly:NUGET_API_KEY]
github_actions_secret.cdktf-provider-launchdarkly_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_6A5F0817: Refreshing state... [id=cdktf-provider-launchdarkly:GO_GITHUB_TOKEN]
github_actions_secret.cdktf-provider-launchdarkly_repo_secret-twine-username_2ED8E9BA: Refreshing state... [id=cdktf-provider-launchdarkly:TWINE_USERNAME]
github_issue_label.cdktf-provider-launchdarkly_repository-setup_auto-approve-label_5683EA18: Refreshing state... [id=cdktf-provider-launchdarkly:auto-approve]
github_actions_secret.cdktf-provider-launchdarkly_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_042F7D01: Refreshing state... [id=cdktf-provider-launchdarkly:PROJEN_GITHUB_TOKEN]
github_actions_secret.cdktf-provider-launchdarkly_repo_secret-npm-token_2815257C: Refreshing state... [id=cdktf-provider-launchdarkly:NPM_TOKEN]
github_repository_webhook.cdktf-provider-launchdarkly_repository-setup_slack-webhook_3C5122C4: Refreshing state... [id=425871226]
github_actions_secret.cdktf-provider-launchdarkly_repo_secret-alert-prs-slack-webhook-url_5DE6A783: Refreshing state... [id=cdktf-provider-launchdarkly:ALERT_PRS_SLACK_WEBHOOK_URL]
github_actions_secret.cdktf-provider-launchdarkly_repo_secret-maven-gpg-private-key_C1E80DCE: Refreshing state... [id=cdktf-provider-launchdarkly:MAVEN_GPG_PRIVATE_KEY]
github_actions_secret.cdktf-provider-launchdarkly_repo_secret-maven-staging-profile-id_9B871CBC: Refreshing state... [id=cdktf-provider-launchdarkly:MAVEN_STAGING_PROFILE_ID]
github_issue_label.cdktf-provider-launchdarkly_repository-setup_no-auto-close-label_DCE6FE57: Refreshing state... [id=cdktf-provider-launchdarkly:no-auto-close]
github_actions_secret.cdktf-provider-launchdarkly_repo_secret-maven-username_244E333C: Refreshing state... [id=cdktf-provider-launchdarkly:MAVEN_USERNAME]
github_team_repository.cdktf-provider-launchdarkly_repository-setup_managing-team_3493A392: Refreshing state... [id=6602018:cdktf-provider-launchdarkly]
github_team_repository.cdktf-provider-mongodbatlas_repository-setup_managing-team_0EB784FF: Refreshing state... [id=6602018:cdktf-provider-mongodbatlas]
github_team_repository.cdktf-provider-launchdarkly-go_repository-setup_managing-team_19901ADF: Refreshing state... [id=6602018:cdktf-provider-launchdarkly-go]
github_team_repository.cdktf-provider-mongodbatlas-go_repository-setup_managing-team_1843C9C7: Refreshing state... [id=6602018:cdktf-provider-mongodbatlas-go]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # github_actions_secret.cdktf-provider-launchdarkly_repo_secret-maven-password_503A29DE will be created
  + resource "github_actions_secret" "cdktf-provider-launchdarkly_repo_secret-maven-password_503A29DE" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-launchdarkly"
      + secret_name     = "MAVEN_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-launchdarkly_repo_secret-maven-username_244E333C will be created
  + resource "github_actions_secret" "cdktf-provider-launchdarkly_repo_secret-maven-username_244E333C" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-launchdarkly"
      + secret_name     = "MAVEN_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-mongodbatlas_repo_secret-maven-password_95B7424C must be replaced
-/+ resource "github_actions_secret" "cdktf-provider-mongodbatlas_repo_secret-maven-password_95B7424C" {
      ~ created_at      = "2023-01-27 16:12:05 +0000 UTC" -> (known after apply)
      ~ id              = "cdktf-provider-mongodbatlas:MAVEN_PASSWORD" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-01-27 16:12:05 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # github_actions_secret.cdktf-provider-mongodbatlas_repo_secret-maven-username_553FE0BE must be replaced
-/+ resource "github_actions_secret" "cdktf-provider-mongodbatlas_repo_secret-maven-username_553FE0BE" {
      ~ created_at      = "2023-01-27 16:12:23 +0000 UTC" -> (known after apply)
      ~ id              = "cdktf-provider-mongodbatlas:MAVEN_USERNAME" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-01-27 16:12:23 +0000 UTC" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 4 to add, 0 to change, 2 to destroy.


```

</details>

*Pusher: @mutahhir, Action: `pull_request_target`, Working Directory: ``, Workflow: `Plan`*